In [2]:
#http://pandas.pydata.org/pandas-docs/stable/comparison_with_sql.html
import pandas as pd
import numpy as np
url = 'https://raw.github.com/pandas-dev/pandas/master/pandas/tests/data/tips.csv'
tips = pd.read_csv(url)
tips.head(3)

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3

In [1]:
#print(type(list(tips.columns)))
#tips.value_counts(tips['sex'].values.ravel())
#tips.value_counts()
#tips['sex'].count()
#tips.value_counts()
#dir(tips).describe()
# Provides data frame no of rows and columns
#tip.shape

# Column Selection and Manipulation

In [29]:
print(tips.columns)
#Display selected columns based on column Display names
tips.loc[:,['total_bill','tip']].head(2)

Index(['total_bill', 'tip', 'sex', 'smoker', 'day', 'time', 'size'], dtype='object')

   total_bill   tip
0       16.99  1.01
1       10.34  1.66

In [23]:
#Gets rows in a given range
start_row, end_row=2,6
tips[start_row:end_row]

     total_bill   tip   sex smoker   day    time  size
23        39.42  7.58  Male     No   Sat  Dinner     4
59        48.27  6.73  Male     No   Sat  Dinner     4
141       34.30  6.70  Male     No  Thur   Lunch     6
183       23.17  6.50  Male    Yes   Sun  Dinner     4

In [25]:
# Select rows and Columns based on integer location
start_row, end_row=3,5
start_col, end_col=0,2

tips.iloc[start_row:end_row,start_col:end_col]
#tips.iloc[3:5,0:2]

     total_bill   tip
59        48.27  6.73
141       34.30  6.70

In [6]:
# Column  Renames or Aliasing
#rename column form total_bill to Total Bill
tips.rename(columns={'total_bill': 'Total Bill'}, inplace=True)
tips.head(3)
tips.rename(columns={'Total Bill': 'total_bill'}, inplace=True)

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3

# Distinct Operations

In [ ]:
#Single Column Distincts 
tips['time'].unique()

#Multiple Column Distincts
tips[['time','smoker']].drop_duplicates(subset=['time','smoker'])

# List of distinct values from multiple columns into a single list
np.unique(tips[['time','smoker']])
# Reference https://www.linkedin.com/pulse/sql-operations-data-using-python-part-1-simple-select-onyshchenko/

# Filtering/Where Condition

In [2]:
# To get first 6 rows in  dataframe
tips.head(6)

#Selecting columns from a data frame and only first 5 rows
#tips[['total_bill', 'tip', 'smoker', 'time']].head(5)

#Selecting columns which fit a particular criteria from a data frame and only top5 rows
#tips[tips['time'] == 'Dinner'][['total_bill', 'tip', 'smoker', 'time']].head(5)

#Selecting columnswhich fit a particular criteria with multiple conditions from a data frame and only top5 rows
[['total_bill', 'tip', 'smoker', 'time']].head(5)

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4
5       25.29  4.71    Male     No  Sun  Dinner     4

# Missing Data( Where)

In [ ]:
#http://pandas.pydata.org/pandas-docs/version/0.15.2/missing_data.html#filling-missing-values-fillna
# look for rows with missing values in a particular column 
lims_df[lims_df['HEAT'].isnull()].head(40)

# look for rows with no missing values in a particular column 
lims_df[lims_df['HEAT'].notnull()].head(40)

#Display selective columns only when displaying data
lims_df[lims_df['HEAT'].notnull()][['tip','total_bill']]

# Sorting Data

In [ ]:
tip.

# Pivot Table

In [12]:
#Pivot Table
tips.pivot_table(index='day', columns='sex', values='tip',aggfunc=np.average)

# Below is a good article for differrence between Pivot and Pivot_table
#http://nikgrozev.com/2015/07/01/reshaping-in-pandas-pivot-pivot-table-stack-and-unstack-explained-with-pictures/

sex     Female      Male
day
Fri   2.781111  2.693000
Sat   2.801786  3.083898
Sun   3.367222  3.220345
Thur  2.575625  2.980333

In [15]:
tips.head()
#p = tips.pivot(index='sex', columns='day', values='total_bill')
#p.head()

     total_bill    tip   sex smoker   day    time  size
170       50.81  10.00  Male    Yes   Sat  Dinner     3
212       48.33   9.00  Male     No   Sat  Dinner     4
23        39.42   7.58  Male     No   Sat  Dinner     4
59        48.27   6.73  Male     No   Sat  Dinner     4
141       34.30   6.70  Male     No  Thur   Lunch     6

# Group BY

In [25]:
#Aggregation
#http://www.shanelynn.ie/summarising-aggregation-and-grouping-data-in-python-pandas/

#Multi column Aggregation
#tips.groupby('day').agg({'tip': np.mean, 'day': np.size})

# multi aggregation  and agg values can be passed as dictionary value and size is equivalent to count* in sql
#tips.groupby(['smoker', 'day']).agg({'tip': [np.size, np.mean]})
tips.groupby(['smoker', 'day']).agg({'tip': {"tip_size":np.size, "tip_mean":np.mean}})


#Average/ Mean of tips by sex
#tips.groupby('sex')['tip'].mean()

              tip
                s        mn
smoker day
No     Fri    4.0  2.812500
       Sat   45.0  3.102889
       Sun   57.0  3.167895
       Thur  45.0  2.673778
Yes    Fri   15.0  2.714000
       Sat   42.0  2.875476
       Sun   19.0  3.516842
       Thur  17.0  3.030000

<img src="pandas_aggregation-768x307.png">

In [ ]:
#Joins 
df1 = pd.DataFrame({'key': ['A', 'B', 'C', 'D'],
                       'value': np.random.randn(4)})
df2 = pd.DataFrame({'key': ['B', 'D', 'D', 'E'],
                       'value': np.random.randn(4)})

# merge performs an INNER JOIN by default
pd.merge(df1, df2, on='key')

# show all records from df1
pd.merge(df1, df2, on='key', how='left')

# show all records from df2
pd.merge(df1, df2, on='key', how='right')

# show all records from both frames

pd.merge(df1, df2, on='key', how='outer')


# Left Join with differrent column names 
#result = pd.merge(df_heat_orignation, df_heat_batch_status_sum, how='left', left_on=['HEAT'], right_on=['HEAT_NO'])

# Sort and Rank

In [3]:
#Row number in sql and sort by rownumber with in a group
(tips.assign(rn=tips.sort_values(['total_bill'], ascending=False)
                       .groupby(['day'])
                       .cumcount() + 1)
        .query('rn < 3')
         .sort_values(['day','rn'])
 )

#another way of doing ranking .
(tips.assign(rnk=tips.groupby(['day'])['total_bill']
                        .rank(method='first', ascending=False))
       .query('rnk < 3')
        .sort_values(['day','rnk'])
    )

     total_bill    tip     sex smoker   day    time  size  rn
95        40.17   4.73    Male    Yes   Fri  Dinner     4   1
90        28.97   3.00    Male    Yes   Fri  Dinner     2   2
170       50.81  10.00    Male    Yes   Sat  Dinner     3   1
212       48.33   9.00    Male     No   Sat  Dinner     4   2
156       48.17   5.00    Male     No   Sun  Dinner     6   1
182       45.35   3.50    Male    Yes   Sun  Dinner     3   2
197       43.11   5.00  Female    Yes  Thur   Lunch     4   1
142       41.19   5.00    Male     No  Thur   Lunch     5   2

In [10]:
# Sort values by biggest tip and then by size.
tips.sort_values(by=['tip','size'],ascending=[False,False])

# Inplace True ensures dataframe is sorted permanently
tips.sort_values(by=['tip','size'],ascending=[False,False],inplace=True)

In [11]:
tips.head()

     total_bill    tip   sex smoker   day    time  size
170       50.81  10.00  Male    Yes   Sat  Dinner     3
212       48.33   9.00  Male     No   Sat  Dinner     4
23        39.42   7.58  Male     No   Sat  Dinner     4
59        48.27   6.73  Male     No   Sat  Dinner     4
141       34.30   6.70  Male     No  Thur   Lunch     6

In [1]:

#Data frame to Json
x=np.random.randn(5,2)
type(x)

NameError: name 'np' is not defined

In [ ]:
#Reference 
#http://www.shanelynn.ie/analysis-of-weather-data-using-pandas-python-and-seaborn/
#http://pandas.pydata.org/pandas-docs/stable/groupby.html#iterating-through-groups
#http://altons.github.io/python/2013/01/21/gentle-introduction-to-mongodb-using-pymongo/